In [1]:
from pandas import DataFrame

In [3]:
data = {
    "city": ["Paris", "Paris", "Paris", "Paris",
             "London", "London", "London", "London",
             "Rome", "Rome", "Rome", "Rome"],
    "year": [2001, 2008, 2009, 2010,
             2001, 2006, 2011, 2015,
             2001, 2006, 2009, 2012],
    "pop": [2.148, 2.211, 2.234, 2.244,
            7.322, 7.657, 8.174, 8.615,
            2.547, 2.627, 2.734, 2.627]
}
census = DataFrame(data)
census

      city  year    pop
0    Paris  2001  2.148
1    Paris  2008  2.211
2    Paris  2009  2.234
3    Paris  2010  2.244
4   London  2001  7.322
5   London  2006  7.657
6   London  2011  8.174
7   London  2015  8.615
8     Rome  2001  2.547
9     Rome  2006  2.627
10    Rome  2009  2.734
11    Rome  2012  2.627

In [4]:
census.head()

     city  year    pop
0   Paris  2001  2.148
1   Paris  2008  2.211
2   Paris  2009  2.234
3   Paris  2010  2.244
4  London  2001  7.322

In [5]:
census["city"]

0      Paris
1      Paris
2      Paris
3      Paris
4     London
5     London
6     London
7     London
8       Rome
9       Rome
10      Rome
11      Rome
Name: city, dtype: object

In [6]:
census["city"] == "Paris"

0      True
1      True
2      True
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: city, dtype: bool

In [7]:
census[census["city"] == "Paris"]

    city  year    pop
0  Paris  2001  2.148
1  Paris  2008  2.211
2  Paris  2009  2.234
3  Paris  2010  2.244

In [8]:
census.loc[4]

city    London
year      2001
pop      7.322
Name: 4, dtype: object

### Exercise

Create the DataFrame containing the census data for the three cities.
Select the data for the year 2001. Which city had the smallest population that year?
Find all the cities which had a population smaller than 2.6 million.

In [13]:
census

      city  year    pop
0    Paris  2001  2.148
1    Paris  2008  2.211
2    Paris  2009  2.234
3    Paris  2010  2.244
4   London  2001  7.322
5   London  2006  7.657
6   London  2011  8.174
7   London  2015  8.615
8     Rome  2001  2.547
9     Rome  2006  2.627
10    Rome  2009  2.734
11    Rome  2012  2.627

In [16]:
census[ census["year"] == 2001 ]

     city  year    pop
0   Paris  2001  2.148
4  London  2001  7.322
8    Rome  2001  2.547

In [19]:
pop = census[census["year"] == 2001]["pop"]
pop

0    2.148
4    7.322
8    2.547
Name: pop, dtype: float64

In [20]:
census["city"][pop.idxmin()]

'Paris'